namespace DaiShu.Web.Model.Service
{
    /// <summary>
    ///     类名称：Dictionary
    ///     命名空间：DaiShu.Web.Model.Service
    ///     类功能：数据字典简单实体
    /// </summary>
    /// 创建者：周超
    /// 创建日期：2015/2/28 18:12
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class Dictionary
    {
        /// <summary>
        ///     设置或取得DictionaryId的值，数据字典Id
        /// </summary>
        /// 创建者：周超
        /// 创建日期：2015/2/28 10:36:57
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------

        public int DictionaryId { get; set; }

        /// <summary>
        ///     设置或取得ParentCode的值，父节点编码
        /// </summary>
        /// 创建者：周超
        /// 创建日期：2015/2/28 10:36:57
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------

        public string ParentCode { get; set; }

        /// <summary>
        ///     设置或取得Name的值，名称
        /// </summary>
        /// 创建者：周超
        /// 创建日期：2015/2/28 10:36:57
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------

        public string Name { get; set; }

        /// <summary>
        ///     设置或取得Code的值，编码
        /// </summary>
        /// 创建者：周超
        /// 创建日期：2015/2/28 10:36:57
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------

        public string Code { get; set; }

        /// <summary>
        ///     设置或取得Description的值，详细描述
        /// </summary>
        /// 创建者：周超
        /// 创建日期：2015/2/28 10:36:57
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------

        public string Description { get; set; }
    }
}