using System.Collections.Generic;

namespace DaiShu.Web.Model.Service.WebSiteConfig
{
    /// <summary>
    /// 类名称：WebSiteConfig
    /// 命名空间：DaiShu.Web.Model.Service.WebSiteConfig
    /// 类功能：网站配置信息
    /// </summary>
    /// 创建者：周超
    /// 创建日期：2015/3/9 15:17
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class WebSiteConfig
    {
        /// <summary>
        ///     设置或取得商户Id
        /// </summary>
        /// <value>
        ///     商户Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/2/28 11:36
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int MerchantId { get; set; }

        /// <summary>
        ///     设置或取得商户名称
        /// </summary>
        /// <value>
        ///     商户名称
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/2/28 11:39
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string MerchantName { get; set; }

        /// <summary>
        ///     设置或取得资金账户类型
        /// </summary>
        /// <value>
        ///     资金账户类型
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/2/28 11:39
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public Dictionary PaymentAccountType { get; set; }

        /// <summary>
        ///     设置或取得域名
        /// </summary>
        /// <value>
        ///     域名
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/2/28 11:39
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Domain { get; set; }

        /// <summary>
        /// 设置或取得皮肤框架
        /// </summary>
        /// <value>
        /// 皮肤框架
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/4/10 13:19
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SkinFrame { get; set; }

        /// <summary>
        /// 设置或取得皮肤颜色
        /// </summary>
        /// <value>
        /// 皮肤颜色
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/4/10 13:34
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SkinColor { get; set; }

        /// <summary>
        ///     设置或取得站点名称
        /// </summary>
        /// <value>
        ///     站点名称
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/2/28 11:39
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SiteName { get; set; }

        /// <summary>
        /// 设置或取得网站Header信息列表
        /// </summary>
        /// <value>
        /// 网站Header信息列表
        /// </value>
        /// 创建者：周超
        /// 创建日期：2015/4/20 16:48
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public List<object> HeadMetaList { get; set; }
    }
}